[
  {
    "city": "Paris",
    "country": "France",
    "clues": ["City of Love", "Capital of France"],
    "fun_fact": ["The Eiffel Tower was originally intended for Barcelona.", "The Louvre Museum has a giant pyramid in the center of its glass pyramid entrance."],
    "trivia": ["Paris is often called the 'City of Light' due to its historical association with the Enlightenment.", "The city has more than 1,000 parks and gardens."]
  },
  {
    "city": "Tokyo",
    "country": "Japan",
    "clues": ["Vibrant city with neon lights", "Capital of Japan"],
    "fun_fact": ["Tokyo has the world's busiest intersection, Shibuya Crossing.", "The city has over 30,000 restaurants serving a wide variety of cuisines."],
    "trivia": ["Tokyo is home to the Tokyo Tower, a communications tower with a height of 332.9 meters.", "The city has a unique address system, with buildings and streets numbered in a specific order."]
  },
  {
    "city": "New York City",
    "country": "USA",
    "clues": ["City that never sleeps", "Financial hub of the USA"],
    "fun_fact": ["The Statue of Liberty was a gift from France to the USA.", "Central Park is one of the largest urban parks in the world, covering over 843 acres."],
    "trivia": ["New York City is home to the world's largest public library, the New York Public Library.", "The city has more than 24/7 subway lines, with trains running continuously throughout the day."]
  },
  {
    "city": "Bangkok",
    "country": "Thailand",
    "clues": ["City of temples and street food", "Capital of Thailand"],
    "fun_fact": ["The Grand Palace in Bangkok is one of the most iconic landmarks in Thailand.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
    "trivia": ["Bangkok is home to the famous floating markets, where vendors sell everything from fresh produce to souvenirs.", "The city has a population of over 8 million people, making it one of the most populous cities in the world."]
  },
  {
    "city": "Rome",
    "country": "Italy",
    "clues": ["City of ancient ruins and delicious food", "Capital of Italy"],
    "fun_fact": ["The Colosseum in Rome is one of the most iconic landmarks in the world, with a seating capacity of over 50,000 people.", "The city has more than 2,000 years of history, with ruins dating back to the Roman Empire."],
    "trivia": ["Rome is home to the Vatican City, an independent city-state within Rome.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Sydney",
    "country": "Australia",
    "clues": ["City of iconic landmarks and beautiful beaches", "Capital of New South Wales"],
    "fun_fact": ["The Sydney Opera House is one of the most iconic buildings in the world, with a distinctive sail-like design.", "The city has more than 4,000 beaches, with some of the most beautiful and pristine beaches in the world."],
    "trivia": ["Sydney is home to the famous Sydney Harbour Bridge, with a height of 134 meters and a length of 503 meters.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Cairo",
    "country": "Egypt",
    "clues": ["City of ancient pyramids and mosques", "Capital of Egypt"],
    "fun_fact": ["The Pyramids of Giza are one of the Seven Wonders of the Ancient World, with the Great Pyramid of Khufu being the largest.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Egyptian civilization."],
    "trivia": ["Cairo is home to the Egyptian Museum, which houses the world's largest collection of ancient Egyptian artifacts.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Beijing",
    "country": "China",
    "clues": ["City of ancient history and modern technology", "Capital of China"],
    "fun_fact": ["The Great Wall of China is one of the longest structures in the world, with a length of over 13,000 miles.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Chinese civilization."],
    "trivia": ["Beijing is home to the Forbidden City, a palace complex that was the imperial palace of the Ming and Qing dynasties.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Mumbai",
    "country": "India",
    "clues": ["City of Bollywood and street food", "Financial hub of India"],
    "fun_fact": ["The Gateway of India is one of the most iconic landmarks in Mumbai, with a height of 26 meters and a width of 27 meters.", "The city has more than 1,000 temples, with some of the most beautiful and historic temples in India."],
    "trivia": ["Mumbai is home to the famous Bollywood film industry, with over 1,000 films produced every year.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "clues": ["City of Carnival and beautiful beaches", "Capital of Rio de Janeiro state"],
    "fun_fact": ["The Christ the Redeemer statue in Rio is one of the most iconic landmarks in the world, with a height of 98 feet and a width of 92 feet.", "The city has more than 2,000 beaches, with some of the most beautiful and pristine beaches in the world."],
    "trivia": ["Rio is home to the famous Carnival celebrations, with over 2 million people attending the festivities every year.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Istanbul",
    "country": "Turkey",
    "clues": ["City of ancient history and modern culture", "Capital of Turkey"],
    "fun_fact": ["The Hagia Sophia in Istanbul is one of the most iconic landmarks in the world, with a height of 180 feet and a width of 180 feet.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Greek and Roman civilizations."],
    "trivia": ["Istanbul is home to the famous Bosphorus Strait, which separates Europe and Asia.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Shanghai",
    "country": "China",
    "clues": ["City of modern skyscrapers and ancient history", "Financial hub of China"],
    "fun_fact": ["The Shanghai Tower is one of the tallest buildings in the world, with a height of 632 meters and a width of 128 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Chinese civilization."],
    "trivia": ["Shanghai is home to the famous Bund, a waterfront area with colonial-era architecture.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Barcelona",
    "country": "Spain",
    "clues": ["City of Gaudí and beautiful beaches", "Capital of Catalonia"],
    "fun_fact": ["The Sagrada Família in Barcelona is one of the most iconic landmarks in the world, with a height of 170 meters and a width of 170 meters.", "The city has more than 4,000 beaches, with some of the most beautiful and pristine beaches in the world."],
    "trivia": ["Barcelona is home to the famous Park Güell, a public park designed by Antoni Gaudí.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Cape Town",
    "country": "South Africa",
    "clues": ["City of stunning natural beauty and vibrant culture", "Capital of Western Cape province"],
    "fun_fact": ["Table Mountain in Cape Town is one of the most iconic landmarks in the world, with a height of 1,086 meters and a width of 1,086 meters.", "The city has more than 2,000 beaches, with some of the most beautiful and pristine beaches in the world."],
    "trivia": ["Cape Town is home to the famous Cape of Good Hope, a peninsula with stunning natural beauty and wildlife.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Athens",
    "country": "Greece",
    "clues": ["City of ancient ruins and delicious food", "Capital of Greece"],
    "fun_fact": ["The Acropolis in Athens is one of the most iconic landmarks in the world, with a height of 150 meters and a width of 150 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Greek civilization."],
    "trivia": ["Athens is home to the famous National Archaeological Museum, which houses the world's largest collection of ancient Greek artifacts.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Dubai",
    "country": "United Arab Emirates",
    "clues": ["City of modern skyscrapers and luxurious shopping", "Financial hub of UAE"],
    "fun_fact": ["The Burj Khalifa in Dubai is one of the tallest buildings in the world, with a height of 828 meters and a width of 163 meters.", "The city has more than 1,000 shopping malls, with some of the most luxurious and high-end shopping centers in the world."],
    "trivia": ["Dubai is home to the famous Dubai Mall, which is one of the largest shopping malls in the world.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Hong Kong",
    "country": "China",
    "clues": ["City of modern skyscrapers and ancient history", "Financial hub of China"],
    "fun_fact": ["The Victoria Peak in Hong Kong is one of the most iconic landmarks in the world, with a height of 552 meters and a width of 552 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Chinese civilization."],
    "trivia": ["Hong Kong is home to the famous Temple Street Night Market, which is one of the largest and most famous night markets in the world.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Bangkok",
    "country": "Thailand",
    "clues": ["City of temples and street food", "Capital of Thailand"],
    "fun_fact": ["The Grand Palace in Bangkok is one of the most iconic landmarks in Thailand.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Thai civilization."],
    "trivia": ["Bangkok is home to the famous floating markets, where vendors sell everything from fresh produce to souvenirs.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Kuala Lumpur",
    "country": "Malaysia",
    "clues": ["City of modern skyscrapers and ancient history", "Capital of Malaysia"],
    "fun_fact": ["The Petronas Twin Towers in Kuala Lumpur are one of the most iconic landmarks in the world, with a height of 452 meters and a width of 88 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Malay civilization."],
    "trivia": ["Kuala Lumpur is home to the famous Batu Caves, a series of limestone caves with stunning natural beauty and Hindu temples.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Singapore",
    "country": "Singapore",
    "clues": ["City-state with modern skyscrapers and Gardens by the Bay", "Financial hub of Singapore"],
    "fun_fact": ["The Marina Bay Sands in Singapore is one of the most iconic landmarks in the world, with a height of 340 meters and a width of 200 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Singaporean civilization."],
    "trivia": ["Singapore is home to the famous Gardens by the Bay, a series of gardens with stunning natural beauty and futuristic architecture.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Seoul",
    "country": "South Korea",
    "clues": ["City of modern technology and ancient history", "Capital of South Korea"],
    "fun_fact": ["The Gyeongbokgung Palace in Seoul is one of the most iconic landmarks in the world, with a height of 80 meters and a width of 80 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Korean civilization."],
    "trivia": ["Seoul is home to the famous Myeong-dong shopping district, which is one of the largest and most famous shopping districts in the world.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Tokyo",
    "country": "Japan",
    "clues": ["City of vibrant culture and modern technology", "Capital of Japan"],
    "fun_fact": ["The Tokyo Tower in Tokyo is one of the most iconic landmarks in the world, with a height of 332.9 meters and a width of 32 meters.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Japanese civilization."],
    "trivia": ["Tokyo is home to the famous Shibuya Crossing, which is one of the busiest intersections in the world.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Sydney",
    "country": "Australia",
    "clues": ["City of iconic landmarks and beautiful beaches", "Capital of New South Wales"],
    "fun_fact": ["The Sydney Opera House in Sydney is one of the most iconic landmarks in the world, with a height of 83 meters and a width of 88 meters.", "The city has more than 4,000 beaches, with some of the most beautiful and pristine beaches in the world."],
    "trivia": ["Sydney is home to the famous Sydney Harbour Bridge, which is one of the most iconic landmarks in the world.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  },
  {
    "city": "Cairo",
    "country": "Egypt",
    "clues": ["City of ancient pyramids and mosques", "Capital of Egypt"],
    "fun_fact": ["The Pyramids of Giza in Cairo are one of the Seven Wonders of the Ancient World, with the Great Pyramid of Khufu being the largest.", "The city has more than 2,000 years of history, with ruins dating back to the ancient Egyptian civilization."],
    "trivia": ["Cairo is home to the Egyptian Museum, which houses the world's largest collection of ancient Egyptian artifacts.", "The city has a unique address system, with buildings and streets numbered in a specific order."],
  }
]